syllabus.org
#+TITLE:DSC 482.01 Fall 2021 Syllabus
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Artificial Intelligence
#+options: toc:nil
* General Course Information

  * Meeting Times: Monday/Wednesday/Friday, 09:00-09:50 hrs
  * Meeting place: Derby Center 209 (computer lab)
  * Professor: Marcus Birkenkrahe
  * Office: Derby 210
  * Phone: (870) 307-7254
  * Office hours: Mon/Wed/Fri 10:00-10:30 AM; Tue/Thu 4-4:30 PM
  * Text: AIMA - /Artificial Intelligence - A Modern Approach (4th
    edition)/, by Stuart Russell and Peter Norvig, Pearson 2021.

** Objectives

   Artificial intelligence has been a goal of computer science (CS)
   since the early days of the field in the 1950s. Unlike other areas
   of CS, it has undergone major trend swings. Currently, AI enjoys
   another (its third) spring. In truth, though, AI is not just one
   field, but several interconnected fields. In this seminar, we will
   work together to identify and understand the AI subfields that are
   industrially relevant, and separate them from the more arcane areas
   that may, or may not be relevant in the near future. This special
   topic seminar is for everyone who is interested in AI. We will
   discuss algorithmic, social, philosophical, commercial and
   technical aspects of AI.

** Student Learning Outcomes

   Students who complete DSC 482.01 "Artificial Intelligence", will be
   able to:

   * understand the history and importance of AI for society
   * know how to solve problems in complex environments
   * know how AI can be used for sales and marketing
   * understand agent-based technologies for different applications
   * understand the conceptual basics of machine learning techniques
   * design an own application using AI principles and techniques

** Course requirements

   No prior knowledge required. Some knowledge of, and experience with
   algorithms is useful but not critical. Curiosity is essential. You
   will gain data literacy skills by taking this course. The course
   will prepare you for further studies in machine learning and deep
   learning, but also in conceptual applications of AI, like machine
   ethics.

** Grading system

   | WHEN            | DESCRIPTION    | IMPACT |
   |-----------------+----------------+--------|
   | Weekly          | Participation  |    15% |
   | Before midterms | Protocol       |    15% |
   | TBD             | Presentation   |    30% |
   | Last week       | AI application |    40% |

*** Grading table

    This table is used to convert completion rates into letter
    grades. For the midterm results, letter grades still carry signs,
    while for the term results, only straight letters are given (by
    rounding up).

    |--------+-----------------+---------------|
    |    *%* | *Midterm Grade* | *Final Grade* |
    |--------+-----------------+---------------|
    | 100-98 | A+              |               |
    |  97-96 | A               | A             |
    |  95-90 | A-              |               |
    |--------+-----------------+---------------|
    |  89-86 | B+              |               |
    |  85-80 | B               | B             |
    |  79-76 | B-              |               |
    |--------+-----------------+---------------|
    |  75-70 | C+              |               |
    |  69-66 | C               | C             |
    |  65-60 | C-              |               |
    |--------+-----------------+---------------|
    |  59-56 | D+              |               |
    |  55-50 | D               | D             |
    |--------+-----------------+---------------|
    |   49-0 | F               | F             |
    |--------+-----------------+---------------|


*** Presentation (30%)

    * Present part of a chapter from AIMA, OR
    * Review and present an AI research paper, OR
    * Research and present an AI application.

*** Application (40%)

    * Identify an AI application area, AND
    * Research how AI could be used, AND
    * Present briefly at sprint reviews, AND
    * Present your application idea at the end of term.

*** Protocol (15%)

    * Record a classroom session, AND
    * Create a protocol of the session, AND
    * Upload the protocol to GitHub.

*** Participation (15%)

    * Participate in group discussions, OR
    * Participate in class discussion, OR
    * Present a glossary term, OR
    * Present an interesting AI application.

*** Grading examples

**** Example - Midterm grade

     At midterms, student X has achieved the following results:

     | GRADE PART           | WEIGHT   | RESULT   |
     |----------------------+----------+----------|
     | Session Protocol     |      15% |      80% |
     | Weekly participation |      15% |      90% |

     # Student X's midterm result is computed as follows:

     # #+begin_src R :session :results output
     #   ## midterm weights (only practice and participation)
     #   weight_m <- c("protocol"=0.5,
     #                 "participation"=0.5)
     #   ## results vector
     #   result_m <- c("protocol"=80,
     #                 "participation"=90)
     #   ## midterm grade
     #   grade_m <-
     #     weight_m["protocol"] * result_m["protocol"] +
     #     weight_m["participation"] * result_m["participation"]
     #   names(grade_m) <- NULL
     #   grade_m
     # #+end_src

     # #+RESULTS:
     # : [1] 85

     Student X's midterm result is a "B" (~85%~).

**** Example - Final grade

     After the finals, student X has achieved the following results:

     | GRADE PART           | WEIGHT | RESULT |
     |----------------------+--------+--------|
     | Session protocol     |    15% |    80% |
     | Weekly participation |    15% |    90% |
     | Presentation         |    30% |    95% |
     | Final application    |    40% |    95% |

     # # Student X's midterm result is computed as follows:

     # #+begin_src R :session :results output
     #   ## full term weight vector according to grading table
     #   weight <- c("presentation"= 0.3,
     #               "application"=0.4,
     #               "protocol"=0.15,
     #               "participation"=0.15)
     #   ## results vector
     #   result <- c("presentation"=95,
     #               "application"=95,
     #               "protocol"=80,
     #               "participation"=90)
     #   ## midterm grade
     #   grade <-
     #     weight["presentation"] * result["presentation"] +
     #     weight["application"] * result["application"] +
     #     weight["protocol"] * result["protocol"] +
     #     weight["participation"] * result["participation"]
     #   names(grade) <- NULL
     #   grade
     # #+end_src

     # #+RESULTS:
     # : [1] 92

     Student X's midterm result is an "A" (~92%~).

* Standard Policies
** Honor Code

   All graded work in this class is to be pledged in accordance with
   the Lyon College Honor Code. The use of a phone for any reason
   during the course of an exam is considered an honor code
   violation.

** Class Attendance Policy

   Students are expected to attend all class periods for the courses
   in which they are enrolled. They are responsible for conferring
   with individual professors regarding any missed
   assignments. Faculty members are to notify the Registrar when a
   student misses the equivalent of one, two, three, and four weeks
   of class periods in a single course. Under this policy, there is
   no distinction between “excused” and “unexcused” absences, except
   that a student may make up work missed during an excused
   absence. A reminder of the college’s attendance policy will be
   issued to the student at one week, a second reminder at two weeks,
   a warning at three weeks, and notification of administrative
   withdrawal and the assigning of an “F” grade at four
   weeks. Students who are administratively withdrawn from more than
   one course will be placed on probation or suspended.

** Disabilities

   Students seeking reasonable accommodations based on documented
   learning disabilities must contact Danell Hetrick in the Morrow
   Academic Center at (870) 307-7021 or at danell.hetrick@lyon.edu.

