syllabus.md


# General Course Information

-   Meeting Times: Monday/Wednesday/Friday, 09:00-09:50 hrs
-   Meeting place: Derby Center 021
-   Professor: Marcus Birkenkrahe
-   Office: Derby 210
-   Phone: (870) 307-7254
-   Office hours: Mon/Wed/Fri 10:00-10:30 AM; Tue/Thu 4-4:30 PM
-   Text: AIMA - *Artificial Intelligence - A Modern Approach (4th
    edition)*, by Stuart Russell and Peter Norvig, Pearson 2021.


## Objectives

Artificial intelligence has been a goal of computer science (CS)
since the early days of the field in the 1950s. Unlike other areas
of CS, it has undergone major trend swings. Currently, AI enjoys
another (its third) spring. In truth, though, AI is not just one
field, but several interconnected fields. In this seminar, we will
work together to identify and understand the AI subfields that are
industrially relevant, and separate them from the more arcane areas
that may, or may not be relevant in the near future. This special
topic seminar is for everyone who is interested in AI. We will
discuss algorithmic, social, philosophical, commercial and
technical aspects of AI.


## Student Learning Outcomes

Students who complete DSC 482.01 "Artificial Intelligence", will be
able to:

-   understand the history and importance of AI for society
-   know how to solve problems in complex environments
-   know how AI can be used for sales and marketing
-   understand agent-based technologies for different applications
-   understand the conceptual basics of machine learning techniques
-   design an own application using AI principles and techniques


## Course requirements

No prior knowledge required. Some knowledge of, and experience with
algorithms is useful but not critical. Curiosity is essential. You
will gain data literacy skills by taking this course. The course
will prepare you for further studies in machine learning and deep
learning, but also in conceptual applications of AI, like machine
ethics.


## Grading system

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">WHEN</th>
<th scope="col" class="org-left">DESCRIPTION</th>
<th scope="col" class="org-right">IMPACT</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Weekly</td>
<td class="org-left">Participation</td>
<td class="org-right">15%</td>
</tr>


<tr>
<td class="org-left">TBD</td>
<td class="org-left">Protocol</td>
<td class="org-right">15%</td>
</tr>


<tr>
<td class="org-left">TBD</td>
<td class="org-left">Presentation</td>
<td class="org-right">40%</td>
</tr>


<tr>
<td class="org-left">Last week</td>
<td class="org-left">AI application</td>
<td class="org-right">30%</td>
</tr>
</tbody>
</table>


### Grading table

This table is used to convert completion rates into letter
grades. For the midterm results, letter grades still carry signs,
while for the term results, only straight letters are given (by
rounding up).

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">**%**</th>
<th scope="col" class="org-left">**Midterm Grade**</th>
<th scope="col" class="org-left">**Final Grade**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">100-98</td>
<td class="org-left">A+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">97-96</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
</tr>


<tr>
<td class="org-right">95-90</td>
<td class="org-left">A-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">89-86</td>
<td class="org-left">B+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">85-80</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
</tr>


<tr>
<td class="org-right">79-76</td>
<td class="org-left">B-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">75-70</td>
<td class="org-left">C+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">69-66</td>
<td class="org-left">C</td>
<td class="org-left">C</td>
</tr>


<tr>
<td class="org-right">65-60</td>
<td class="org-left">C-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">59-56</td>
<td class="org-left">D+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">55-50</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">49-0</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
</tr>
</tbody>
</table>


### Presentation 40%)

-   Present part of a chapter from AIMA, OR
-   Review and present an AI research paper, OR
-   Research and present an AI application.


### Application (30%)

-   Identify an AI application area, AND
-   Research how AI could be used, AND
-   Present your application idea in class.


### Protocol (15%)

-   Record a classroom session, AND
-   Create a protocol of the session, AND
-   Upload the protocol to GitHub.


### Participation (15%)

-   Participate in group discussions, OR
-   Participate in class discussion, OR
-   Present a glossary term, OR
-   Present an interesting AI application.


# Standard Policies


## Honor Code

All graded work in this class is to be pledged in accordance with
the Lyon College Honor Code. The use of a phone for any reason
during the course of an exam is considered an honor code
violation.


## Class Attendance Policy

Students are expected to attend all class periods for the courses
in which they are enrolled. They are responsible for conferring
with individual professors regarding any missed
assignments. Faculty members are to notify the Registrar when a
student misses the equivalent of one, two, three, and four weeks
of class periods in a single course. Under this policy, there is
no distinction between “excused” and “unexcused” absences, except
that a student may make up work missed during an excused
absence. A reminder of the college’s attendance policy will be
issued to the student at one week, a second reminder at two weeks,
a warning at three weeks, and notification of administrative
withdrawal and the assigning of an “F” grade at four
weeks. Students who are administratively withdrawn from more than
one course will be placed on probation or suspended.


## Disabilities

Students seeking reasonable accommodations based on documented
learning disabilities must contact Danell Hetrick in the Morrow
Academic Center at (870) 307-7021 or at danell.hetrick@lyon.edu.
