syllabus.org
** Schedule and session content

   | DATE       | AIMA                     | PROJECTS               |
   |------------+--------------------------+------------------------|
   | Wed-18-Aug | Course overview          |                        |
   | Fri-20-Aug |                          |                        |
   |------------+--------------------------+------------------------|
   | Mon-23-Aug | What is AI?              |                        |
   | Wed-25-Aug |                          | Session Protocol 1     |
   | Fri-27-Aug |                          | Session Protocol 2     |
   |------------+--------------------------+------------------------|
   | Mon-30-Aug | History of AI            |                        |
   | Wed-1-Sep  |                          | Session Protocol 3     |
   | Fri-3-Sep  |                          | Session Protocol 4     |
   |------------+--------------------------+------------------------|
   | Mon-6-Sep  | LABOR DAY                |                        |
   | Wed-8-Sep  | State of the Art of AI   |                        |
   | Fri-10-Sep | APPLICATIONS             | 1st sprint review      |
   |------------+--------------------------+------------------------|
   | Mon-13-Sep | Risks and benefits of AI |                        |
   | Wed-15-Sep |                          | Session Protocol 5     |
   | Fri-17-Sep |                          | Session Protocol 6     |
   |------------+--------------------------+------------------------|
   | Mon-20-Sep | Introduction summary     |                        |
   | Wed-22-Sep | Topical Presentation 1   | Session Protocol 7     |
   | Fri-24-Sep | Topical Presentation 2   | Session Protocol 8     |
   |------------+--------------------------+------------------------|
   | Mon-27-Sep |                          | Session Protocol 9     |
   | Wed-29-Sep | Topical Presentation 3   | Session Protocol 10    |
   | Fri-1-Oct  | Topical Presentation 4   | Session Protocol 11    |
   |------------+--------------------------+------------------------|
   | Mon-4-Oct  | FALL BREAK               |                        |
   | Wed-6-Oct  | Topical Presentation 5   | Session Protocol 12(X) |
   | Fri-8-Oct  | APPLICATIONS             | 2nd sprint review      |
   |------------+--------------------------+------------------------|
   | Mon-11-Oct |                          |                        |
   | Wed-13-Oct | Topical Presentation 6   | Session Protocol 13(X) |
   | Fri-15-Oct |                          |                        |
   |------------+--------------------------+------------------------|
   | Mon-18-Oct |                          |                        |
   | Wed-20-Oct | SERVICE DAY              |                        |
   | Fri-22-Oct | Topical Presentation 7   | Session Protocol 14(X) |
   |------------+--------------------------+------------------------|
   | Mon-25-Oct |                          |                        |
   | Wed-27-Oct | Topical Presentation 8   | Session Protocol 15(X) |
   | Fri-29-Oct |                          |                        |
   |------------+--------------------------+------------------------|
   | Mon-1-Nov  |                          |                        |
   | Wed-3-Nov  | Topical Presentation 9   | Session Protocol 16(X) |
   | Fri-5-Nov  | APPLICATIONS             | 3rd sprint review      |
   |------------+--------------------------+------------------------|
   | Mon-8-Nov  |                          |                        |
   | Wed-10-Nov | Topical Presentation 10  | Session Protocol 17(X) |
   | Fri-12-Nov |                          |                        |
   |------------+--------------------------+------------------------|
   | Mon-15-Nov |                          |                        |
   | Wed-17-Nov | Topical Presentation 11  | Session Protocol 18(X) |
   | Fri-19-Nov |                          |                        |
   |------------+--------------------------+------------------------|
   | 22-Nov     |                          |                        |
   | 24-Nov     | THANKSGIVING             |                        |
   | 26-Nov     | THANKSGIVING             |                        |
   |------------+--------------------------+------------------------|
   | 29-Nov     | PROJECT PRESENTATIONS    |                        |
   | 1-Dec      | PROJECT PRESENTATIONS    |                        |
   | 3-Dec      | PROJECT PRESENTATIONS    |                        |
   |------------+--------------------------+------------------------|

   (X) = Extra credit
