syllabus.md


## Schedule and session content

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DATE</th>
<th scope="col" class="org-left">AIMA</th>
<th scope="col" class="org-left">PROJECTS</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Wed-18-Aug</td>
<td class="org-left">Course overview</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-20-Aug</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-23-Aug</td>
<td class="org-left">What is AI?</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-25-Aug</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-27-Aug</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-30-Aug</td>
<td class="org-left">History of AI</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-1-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-3-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-6-Sep</td>
<td class="org-left">LABOR DAY</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-8-Sep</td>
<td class="org-left">State of the Art of AI</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-10-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1st sprint review</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-13-Sep</td>
<td class="org-left">Risks and benefits of AI</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-15-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-17-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-20-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-22-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-24-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-27-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-29-Sep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-1-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-4-Oct</td>
<td class="org-left">FALL BREAK</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-6-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-8-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2nd sprint review</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-11-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-13-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-15-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-18-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-20-Oct</td>
<td class="org-left">SERVICE DAY</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-22-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-25-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-27-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-29-Oct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-1-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-3-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-5-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3rd sprint review</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-8-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-10-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-12-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Mon-15-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Wed-17-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Fri-19-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">22-Nov</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">24-Nov</td>
<td class="org-left">THANKSGIVING</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">26-Nov</td>
<td class="org-left">THANKSGIVING</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">29-Nov</td>
<td class="org-left">PROJECT PRESENTATIONS</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">1-Dec</td>
<td class="org-left">PROJECT PRESENTATIONS</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">3-Dec</td>
<td class="org-left">PROJECT PRESENTATIONS</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

